<a href="https://colab.research.google.com/github/jaswanttaur/Learn-Python/blob/main/TEQIP_Lab_on_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Manipulation with Pandas
Pandas is a package built on top of NumPy, and provides an **efficient** implementation of a **DataFrame** Can be also thought of as a **Microsoft Excel** replacement in Python. DataFrames are essentially multidimensional tables with rows and columns, Pandas implements a number of powerful data operation tools familiar to users of both database frameworks and spreadsheet programs.


## Installation
One can simply install Pandas on their local system using ```pip install pandas```. Make sure that you have NumPy install beforehand (```pip install numpy```).


> Considering, Google Colab already has all the built in packages, we don't need to worry.

## Verifying if pandas is installed correctly

In [1]:
import pandas as pd
print(pd.__version__)

1.1.5

## Making Spreadsheets from Python Objects.

### Basic Pandas Functionality.

Making a dataframe.
> ```df = pd.Dataframe(<data>)```

Viewing the dataframe.
> ```df``` or ```print(df)``` 

Viewing top rows.
>```df.head(<no of rows)```

Viewing bottom rows.
>```df.tail(<no of rows>)```

Some other useful methods.
- ```df.describe()``` statistics of the data
- ```df.info()``` information about the data
- ```df.dtypes``` datatype per column
- ```df.count()``` number of values per column

### DataFrames from Python Lists

In this section, we will be making our pandas dataframe using lists from Python. 
> To make our data frame, we need two things, the column names and the content for the table.

In [ ]:
# First we decide the columns and name them. Lets make a student database for say.
columnNames = ["RollNumber","Name","Physics","Chemistry","Maths"]

# Now that we have our columns decided, lets fill some data. For data here 
# we are using lists.
students = [[1,"Naman",98,90,93],[2,"Ronak",54,76,90],[3,"Shyam",90,48,86],[4,"Harsh",75,87,63],[5,"Rajesh",75,86,82]]

Now that we have our data and column names, lets make our first pandas dataframe, for this we will use 
>```pd.DataFrame(<data>,columns=<columnnames>)```<br>
> This function returns us a pandas dataframe filled with our data.

In [ ]:
# We save the dataframe in a variable.
student_table = pd.DataFrame(students,columns=columnNames)

# To view our dataframe we simply write its name or we can use the print function - print(<dataframe>).
student_table

   RollNumber    Name  Physics  Chemistry  Maths
0           1   Naman       98         90     93
1           2   Ronak       54         76     90
2           3   Shyam       90         48     86
3           4   Harsh       75         87     63
4           5  Rajesh       75         86     82

As we can see, pandas by default starts indexing the data from 0. But in our student database we want our indexing to be based on the rollnumber of the student.

> To change the indexing, we use the function ```<dataframe>.set_index(<RowName>)```

>**Note**: In pandas, every set of function we make on the dataframe shows us a view of the dataframe, which means that the orignal database is not changed. To make sure the orignal database is changed, we use the flag, ```inplace=True``` inside the functions

In [ ]:
# We set the RollNumber column as the indexing
student_table.set_index("RollNumber",inplace=True)

# For viewing the changed dataset
student_table

              Name  Physics  Chemistry  Maths
RollNumber
1            Naman       98         90     93
2            Ronak       54         76     90
3            Shyam       90         48     86
4            Harsh       75         87     63
5           Rajesh       75         86     82

Ahh crap! we forgot a student! Now we need to add him as well to our data frame. Lets do that, shall we?
> we use ```<dataframe>.loc[<index>]``` to go row-wise in pandas. Here we are using the roll number of a student as an index.

In [ ]:
# Note, now that we index with Rollnumber we dont need to add rollnumber.
new_student = ["Jainam",95,64,78]

# Lets say the roll number of the student is 8
student_table.loc[8] = new_student

student_table

              Name  Physics  Chemistry  Maths
RollNumber
1            Naman       98         90     93
2            Ronak       54         76     90
3            Shyam       90         48     86
4            Harsh       75         87     63
5           Rajesh       75         86     82
8           Jainam       95         64     78

Now, to add a column, for say a new subject marks. we can simply use 
>```<dataframe>["<Newcolumn>"]=[<columndata>]```

In [ ]:
# Lets add the new subject column first
bio = [97,56,58,85,78,82]
student_table["Biology"] = bio 

student_table

              Name  Physics  Chemistry  Maths  Biology
RollNumber
1            Naman       98         90     93       97
2            Ronak       54         76     90       56
3            Shyam       90         48     86       58
4            Harsh       75         87     63       85
5           Rajesh       75         86     82       78
8           Jainam       95         64     78       82

Now lets say we need one more column for the total marks. One way we can do this is manually count all the totals. 

But the better way will be to ask pandas to do it for us.

In [ ]:
# Making a new column by panadas operation
student_table["Total"] = student_table["Physics"]+student_table["Maths"]+student_table["Chemistry"]+student_table["Biology"]

student_table

              Name  Physics  Chemistry  Maths  Biology  Total
RollNumber
1            Naman       98         90     93       97    378
2            Ronak       54         76     90       56    276
3            Shyam       90         48     86       58    282
4            Harsh       75         87     63       85    310
5           Rajesh       75         86     82       78    321
8           Jainam       95         64     78       82    319

Getting values above a threshold in some column

In [ ]:
threshold = 85
subject = "Maths" # Maths, Physics Chemistry or any other column name

student_table[student_table[subject]>=threshold]

             Name  Physics  Chemistry  Maths  Biology  Total
RollNumber
1           Naman       98         90     93       97    378
2           Ronak       54         76     90       56    276
3           Shyam       90         48     86       58    282

Sorting by a column name

In [ ]:
subject = "Physics" # Maths, Physics Chemistry or any other column name
highestfirst = True

student_table.sort_values(subject,ascending = not highestfirst)

              Name  Physics  Chemistry  Maths  Biology  Total
RollNumber
1            Naman       98         90     93       97    378
8           Jainam       95         64     78       82    319
3            Shyam       90         48     86       58    282
4            Harsh       75         87     63       85    310
5           Rajesh       75         86     82       78    321
2            Ronak       54         76     90       56    276

### Dataframes from Python Dictionaries

In [ ]:
cars = {"Company":["Toyata","Suziki","Audi","Honda","Skoda"],"Car Prices":[10000,8000,15000,9000,12000],"Colour":["Black","White","Black","Grey","Brown"]}

In [ ]:
cars_table = pd.DataFrame(cars)
cars_table.index = cars_table.index + 1
cars_table

  Company  Car Prices Colour
1  Toyata       10000  Black
2  Suziki        8000  White
3    Audi       15000  Black
4   Honda        9000   Grey
5   Skoda       12000  Brown

Grouping data according to a column

In [ ]:
coloured_groups = cars_table.groupby(['Colour','Company'])
coloured_groups.first()

                Car Prices
Colour Company
Black  Audi          15000
       Toyata        10000
Brown  Skoda         12000
Grey   Honda          9000
White  Suziki         8000

# Reading spreadsheet files

Donloading our dummy data to work with

In [ ]:
!wget https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv -q

## About Our Dataset
The chipotle dataset contains a set of orders that were made at the Chipotle restraunt, Chipotle is a fast food chain similiar to MCDonalds.

Here we have details about what people ordered on a particular day at chipotle. We have the items that were ordered and their corresponding order ids. 

Importing our dataset we use ```mydata = pd.read_csv('chipotle.tsv',sep="\t")``` as our dataset is in form of a tsv file. tsv stands for tab seperated values.

- For a conventional excel data, one can use
> ```mydata = pd.read_xlsx('file.xlsx')```
  [extra documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html) 

- For csv files (comma seperated files)
> ```mydata = pd.read_csv('file.csv')```
  [extra documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) 
- For any other filetypes <br>
https://pandas.pydata.org/pandas-docs/stable/reference/io.html

In [ ]:
# Reading our file chipotle.tsv
mydata = pd.read_csv('chipotle.tsv',sep="\t") 

# Correcting indexing
mydata.index = mydata.index + 1

# Removing extra columns
mydata.drop("choice_description",axis = 1,inplace=True)

mydata

      order_id  quantity                              item_name item_price
1            1         1           Chips and Fresh Tomato Salsa     $2.39
2            1         1                                   Izze     $3.39
3            1         1                       Nantucket Nectar     $3.39
4            1         1  Chips and Tomatillo-Green Chili Salsa     $2.39
5            2         2                           Chicken Bowl    $16.98
...        ...       ...                                    ...        ...
4618      1833         1                          Steak Burrito    $11.75
4619      1833         1                          Steak Burrito    $11.75
4620      1834         1                     Chicken Salad Bowl    $11.25
4621      1834         1                     Chicken Salad Bowl     $8.75
4622      1834         1                     Chicken Salad Bowl     $8.75

[4622 rows x 4 columns]

### Chipotle Task
- To find number of orders that were **greater than 30$ in total**, as we need to give customers a discount.
- To sort these orders, highest first. 
# - To save the number of items bought and their total bill in an excel file to view later.

#### Converting string to float
We observe that have multiple quantities of some items, thus we need a total column for each item purchesed. We also observe that the current item_price is a string and we need values to work with.

In [ ]:
# Replacing $ symbol as that is not required
mydata["item_price"] = mydata["item_price"].str.replace('$', '')

# Converting string data to float data for calculation 
mydata["item_price"] = mydata["item_price"].astype(float)

# Calculating total column for each item purchased
mydata["Total"] = mydata["item_price"]*mydata["quantity"]

mydata

      order_id  quantity  ... item_price  Total
1            1         1  ...       2.39   2.39
2            1         1  ...       3.39   3.39
3            1         1  ...       3.39   3.39
4            1         1  ...       2.39   2.39
5            2         2  ...      16.98  33.96
...        ...       ...  ...        ...    ...
4618      1833         1  ...      11.75  11.75
4619      1833         1  ...      11.75  11.75
4620      1834         1  ...      11.25  11.25
4621      1834         1  ...       8.75   8.75
4622      1834         1  ...       8.75   8.75

[4622 rows x 5 columns]

#### Groupby order id
Now lets try to group all the items ordered by the same order id to have a better understanding of our dataset.

In [ ]:
# groupby for grouping data 
orders = mydata.groupby(["order_id","item_name"])

orders.first()

                                                quantity  item_price  Total
order_id item_name
1        Chips and Fresh Tomato Salsa                  1        2.39   2.39
         Chips and Tomatillo-Green Chili Salsa         1        2.39   2.39
         Izze                                          1        3.39   3.39
         Nantucket Nectar                              1        3.39   3.39
2        Chicken Bowl                                  2       16.98  33.96
...                                                  ...         ...    ...
1831     Chips                                         1        2.15   2.15
1832     Chicken Soft Tacos                            1        8.75   8.75
         Chips and Guacamole                           1        4.45   4.45
1833     Steak Burrito                                 1       11.75  11.75
1834     Chicken Salad Bowl                            1       11.25  11.25

[4292 rows x 3 columns]

#### Summing grouped data
The above dataframe gives us a better visualization, but our goal is to sum the total bill of each order.

In [ ]:
# grouping the orders by order id and summing the qty of items and their total cost.
orders = mydata.groupby(["order_id"])[["quantity","Total"]].sum() #one can also use [].mean() in order to get average.

orders

          quantity  Total
order_id
1                4  11.56
2                2  33.96
3                2  12.67
4                2  21.00
5                2  13.70
...            ...    ...
1830             2  23.00
1831             3  12.90
1832             2  13.20
1833             2  23.50
1834             3  28.75

[1834 rows x 2 columns]

#### Sorting the total bills
Lets sort the orders such that higher bill items appear first

In [ ]:
# Sorting them in descending order
orders.sort_values("Total",ascending=False, inplace=True)

orders

          quantity    Total
order_id
1443            35  1074.24
511             17   315.29
1559            16   246.00
1660            19   222.75
926             23   205.25
...            ...      ...
1122             2    10.08
1093             2    10.08
614              2    10.08
1014             2    10.08
393              2    10.08

[1834 rows x 2 columns]

#### Finding orders greater than 30 dollars

Now that we have our table that contains the total bill for all the orders, we have to select those orders that have a bill greater than $30.

In [ ]:
# Thresholding results
results = orders[orders["Total"]>=30]

print("Total number of orders with more than a total bill of $30 is",len(results))

results

Total number of orders with more than a total bill of $30 is 253

          quantity    Total
order_id
1443            35  1074.24
511             17   315.29
1559            16   246.00
1660            19   222.75
926             23   205.25
...            ...      ...
149              6    30.40
346              4    30.20
1367             4    30.20
888              5    30.15
1309             4    30.00

[253 rows x 2 columns]

#### Writing into excel files
Now that we have the orders we were looking for, lets save them in an excel file so that we can show it to our friends.

In [ ]:
results.to_excel("ordersgreaterthan30.xlsx")

# Homework Task

In [ ]:
sales = [100,130,119,92,35]
customer_account = ['B100','J101','X102','P103','R104']
city = ['BOS','LA','NYC','SF','CHI']

#### Create a DataFrame with the above data

#### Print the name of the first column

#### Sort the DataFrame by city in descending order (check the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html) for sort)

#### Which customer is in the last row of the DataFrame?

#### Reorder the columns with customer account in the first column

### Click to open Solutions

In [ ]:
# Making the dataframe
df = pd.DataFrame()
df["sales"] = sales
df["customer_account"] = customer_account
df["city"] = city 
print("1. This is the dataframe:\n",df)

# Printing the first column
print("\n2. This is the first column: ", df.columns[0])

# Sorting in descending order by cities.
df.sort_values("city",ascending=False,inplace=True)
print("\n3. The sorted dataframe by series is- \n",df)

# Last Row of the dataframe.
print("\n4. The last row is -",df.tail(1))

# Reordering the columns 
column_names = ["customer_account","sales","city"]
df = df.reindex(columns=column_names)
print("\n5. The reordered dataframe is- \n",df)

1. This is the dataframe:
    sales customer_account city
0    100             B100  BOS
1    130             J101   LA
2    119             X102  NYC
3     92             P103   SF
4     35             R104  CHI

2. This is the first column:  sales

3. The sorted dataframe by series is-
    sales customer_account city
3     92             P103   SF
2    119             X102  NYC
1    130             J101   LA
4     35             R104  CHI
0    100             B100  BOS

4. The last row is -    sales customer_account city
0    100             B100  BOS

5. The reordered dataframe is-
   customer_account  sales city
3             P103     92   SF
2             X102    119  NYC
1             J101    130   LA
4             R104     35  CHI
0             B100    100  BOS